django-wardlow/msp432p4-rfid-driver/rfid_library.c
/*
 * A fairly complete port of the MFRC522 arduino library by Miki Balboa
 * https://github.com/miguelbalboa/rfid/tree/master
 * 
 * SPI implementation based on the MSPware driverlib MSP432 SPI - 3-wire Master Incremented Data example by Timothy Logan
 * 
 * only the uid read, as done in the example, was tested so any more advanced features may not work
 * 
 * assumes that pins are connected as follows
 *  P3.2 -> SDA
 *  P1.5 -> SCK
 *  P1.6 -> MOSI
 *  P1.7 -> MISO
 *
 * Author: Django Wardlow
 * Date: 2/16/24
 */

/* DriverLib Includes */
#include "ti/devices/msp432p4xx/driverlib/driverlib.h"
#include "rfid_library.h"
#include <stdint.h>
#include <stdio.h> //printf(); sprintf();


/* SPI Master Configuration Parameter */
const eUSCI_SPI_MasterConfig spiMasterConfig =
    {
        EUSCI_SPI_CLOCKSOURCE_SMCLK,                             // SMCLK Clock Source
        48000000,                                                // SMCLK = 48MHZ
        4000000,                                                 // SPICLK = 4mhz
        EUSCI_SPI_MSB_FIRST,                                     // MSB First
        EUSCI_B_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT, // Phase
        EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_HIGH,                 // High polarity
        EUSCI_SPI_3PIN                                           // 3Wire SPI Mode
};

// Size of the MFRC522 FIFO
uint8_t FIFO_SIZE = 64; // The FIFO is 64 uint8_ts.

void DelayMs(unsigned int nrms)
{
    unsigned int i, j;
    for (j = 0; j < nrms; j++)
        for (i = 0; i < 320; i++)
            ;
}

//configures the eusci peripheral
void configure_EUSCI(){
    
    //set pins for eusci to eusci mode
    GPIO_setAsPeripheralModuleFunctionInputPin(EUSCI_PORT, EUSCI_PINS, GPIO_PRIMARY_MODULE_FUNCTION);

    // configure chip select pin
    GPIO_setAsOutputPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN);
    GPIO_setOutputHighOnPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN);

    /* Configuring SPI in 3wire master mode */
    SPI_initMaster(EUSCI_PERIPHERAL, &spiMasterConfig);

    /* Enable SPI module */
    SPI_enableModule(EUSCI_PERIPHERAL);

    /*disable spi intrupt*/
    Interrupt_disableInterrupt(INT_EUSCIB0);

}

//sends a byte and receives a byte from the rfid module
uint8_t transfer(uint8_t send)
{
    //wait for transmit to finish
    while (!(SPI_getInterruptStatus(EUSCI_PERIPHERAL, EUSCI_SPI_TRANSMIT_INTERRUPT)))
        ;

    // send register
    SPI_transmitData(EUSCI_PERIPHERAL, send);

    //wait for data to be received
    while (!(SPI_getInterruptStatus(EUSCI_PERIPHERAL, EUSCI_SPI_RECEIVE_INTERRUPT)))
        ;

    // read value
    uint8_t value = SPI_receiveData(EUSCI_PERIPHERAL);

    // EUSCI_B_SPI_clearInterruptFlag(EUSCI_PERIPHERAL, EUSCI_SPI_TRANSMIT_INTERRUPT | EUSCI_SPI_RECEIVE_INTERRUPT);

    return value;
}

void PCD_WriteRegister(PCD_Register reg, ///< The register to write to. One of the PCD_Register enums.
                       uint8_t value     ///< The value to write.
)
{

    // SPI.beginTransaction(SPISettings(MFRC522_SPICLOCK, MSBFIRST, SPI_MODE0)); // Set the settings to work with SPI bus
    GPIO_setOutputLowOnPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN);
    // digitalWrite(_chipSelectPin, LOW);                                        // Select slave
    transfer(reg); // MSB == 0 is for writing. LSB is not used in address. Datasheet section 8.1.2.3.
    transfer(value);
    // digitalWrite(_chipSelectPin, HIGH); // Release slave again
    GPIO_setOutputHighOnPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN);

    // SPI.endTransaction();               // Stop using the SPI bus
} // End PCD_WriteRegister()

void PCD_WriteRegisters(PCD_Register reg, ///< The register to write to. One of the PCD_Register enums.
                        uint8_t count,    ///< The number of uint8_ts to write to the register
                        uint8_t *values   ///< The values to write. uint8_t array.
)
{

    // SPI.beginTransaction(SPISettings(MFRC522_SPICLOCK, MSBFIRST, SPI_MODE0)); // Set the settings to work with SPI bus
    // digitalWrite(_chipSelectPin, LOW);
    GPIO_setOutputLowOnPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN); // Select slave
    transfer(reg);

    uint8_t i; // MSB == 0 is for writing. LSB is not used in address. Datasheet section 8.1.2.3.
    for (i = 0; i < count; i++)
    {
        transfer(values[i]);
    }
    // digitalWrite(_chipSelectPin, HIGH); // Release slave again
    GPIO_setOutputHighOnPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN);
    // SPI.endTransaction();               // Stop using the SPI bus
} // End PCD_Wri

uint8_t PCD_ReadRegister(PCD_Register reg ///< The register to read from. One of the PCD_Register enums.
)
{
    uint8_t value;
    // SPI.beginTransaction(SPISettings(MFRC522_SPICLOCK, MSBFIRST, SPI_MODE0)); // Set the settings to work with SPI bus
    // digitalWrite(_chipSelectPin, LOW);
    GPIO_setOutputLowOnPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN); // Select slave
    transfer(0x80 | reg);                            // MSB == 1 is for reading. LSB is not used in address. Datasheet section 8.1.2.3.
    value = transfer(0);                             // Read the value back. Send 0 to stop reading.
    // digitalWrite(_chipSelectPin, HIGH);
    GPIO_setOutputHighOnPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN); // Release slave again
    // SPI.endTransaction();                                                     // Stop using the SPI bus
    return value;

} // End PCD_ReadRegister()

/**
 * Reads a number of uint8_ts from the specified register in the MFRC522 chip.
 * The interface is described in the datasheet section 8.1.2.
 */
void PCD_ReadRegisters(PCD_Register reg, ///< The register to read from. One of the PCD_Register enums.
                       uint8_t count,    ///< The number of uint8_ts to read
                       uint8_t *values,  ///< uint8_t array to store the values in.
                       uint8_t rxAlign   ///< Only bit positions rxAlign..7 in values[0] are updated.
)
{
    if (count == 0)
    {
        return;
    }
    // printf(F("Reading ")); 	printf(count); printf(F(" uint8_ts from register."));
    uint8_t address = 0x80 | reg; // MSB == 1 is for reading. LSB is not used in address. Datasheet section 8.1.2.3.
    uint8_t index = 0;
    GPIO_setOutputLowOnPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN); // Index in values array.
    count--;                                         // One read is performed outside of the loop
    transfer(address);                               // Tell MFRC522 which address we want to read
    if (rxAlign)
    { // Only update bit positions rxAlign..7 in values[0]
        // Create bit mask for bit positions rxAlign..7
        uint8_t mask = (0xFF << rxAlign) & 0xFF;
        // Read value and tell that we want to read the same address again.
        uint8_t value = transfer(address);
        // Apply mask to both current value of values[0] and the new data in value.
        values[0] = (values[0] & ~mask) | (value & mask);
        index++;
    }
    while (index < count)
    {
        values[index] = transfer(address); // Read value and tell that we want to read the same address again.
        index++;
    }
    values[index] = transfer(0); // Read the final uint8_t. Send 0 to stop reading.
    GPIO_setOutputHighOnPin(CHIP_SELECT_PORT, CHIP_SELECT_PIN);
} // End PCD_ReadRegister()

/**
 * Sets the bits given in mask in register reg.
 */
void PCD_SetRegisterBitMask(PCD_Register reg, ///< The register to update. One of the PCD_Register enums.
                            uint8_t mask      ///< The bits to set.
)
{
    uint8_t tmp;
    tmp = PCD_ReadRegister(reg);
    PCD_WriteRegister(reg, tmp | mask); // set bit mask
} // End PCD_SetRegisterBitMask()

/**
 * Clears the bits given in mask from register reg.
 */
void PCD_ClearRegisterBitMask(PCD_Register reg, ///< The register to update. One of the PCD_Register enums.
                              uint8_t mask      ///< The bits to clear.
)
{
    uint8_t tmp;
    tmp = PCD_ReadRegister(reg);
    PCD_WriteRegister(reg, tmp & (~mask)); // clear bit mask
} // End PCD_ClearRegisterBitMask()

/**
 * Use the CRC coprocessor in the MFRC522 to calculate a CRC_A.
 *
 * @return STATUS_OK on success, STATUS_??? otherwise.
 */
StatusCode PCD_CalculateCRC(uint8_t *data,  ///< In: Pointer to the data to transfer to the FIFO for CRC calculation.
                            uint8_t length, ///< In: The number of uint8_ts to transfer.
                            uint8_t *result ///< Out: Pointer to result buffer. Result is written to result[0..1], low uint8_t first.
)
{
    PCD_WriteRegister(CommandReg, PCD_Idle);       // Stop any active command.
    PCD_WriteRegister(DivIrqReg, 0x04);            // Clear the CRCIRq interrupt request bit
    PCD_WriteRegister(FIFOLevelReg, 0x80);         // FlushBuffer = 1, FIFO initialization
    PCD_WriteRegisters(FIFODataReg, length, data); // Write data to the FIFO
    PCD_WriteRegister(CommandReg, PCD_CalcCRC);    // Start the calculation

    // Wait for the CRC calculation to complete. Check for the register to
    // indicate that the CRC calculation is complete in a loop. If the
    // calculation is not indicated as complete in ~90ms, then time out
    // the operation.
    // const uint32_t deadline = millis() + 89;
    int checks = 6000;
    do
    {
        // DivIrqReg[7..0] bits are: Set2 reserved reserved MfinActIRq reserved CRCIRq reserved reserved
        uint8_t n = PCD_ReadRegister(DivIrqReg);
        if (n & 0x04)
        {                                            // CRCIRq bit set - calculation done
            PCD_WriteRegister(CommandReg, PCD_Idle); // Stop calculating CRC for new content in the FIFO.
            // Transfer the result from the registers to the result buffer
            result[0] = PCD_ReadRegister(CRCResultRegL);
            result[1] = PCD_ReadRegister(CRCResultRegH);
            return STATUS_OK;
        }
        checks--;
    } while (checks > 0);

    // 89ms passed and nothing happened. Communication with the MFRC522 might be down.
    return STATUS_TIMEOUT;
} // End PCD_CalculateCRC()

/////////////////////////////////////////////////////////////////////////////////////
// Functions for manipulating the MFRC522
/////////////////////////////////////////////////////////////////////////////////////

/**
 * Initializes the MFRC522 chip.
 */
void PCD_Init()
{
    //configures the EUSCI peripheral on the msp432
    configure_EUSCI();

    PCD_Reset();

